import UIKit

//: # HomeWork 4

/*:
 ## Задание 1
 Пользователь открывает вклад (deposit) в банке на 5 лет (period) на сумму 500 тыс. рублей. Процентная ставка годовых (rate) составляет 11%. Необходимо просчитать сумму дохода (profit) по окончании срока действия вклада и вывести результат на консоль в таком виде: "Сумма вклада через <... > лет увеличится на <...> и составит <...> рублей".  Для решения данной задачи используйте цикл for-in.
 
 > Сумма вклада увеличивается с каждым годом и процент нужно считать уже от увеличенной суммы.
  */

var deposit = 500_000.0
let period = 5
let interestRate = 0.11
var totalProfit = 0.0

for _ in 1...period {
    let profitPerYear = deposit * interestRate
    totalProfit += profitPerYear
    deposit += profitPerYear
}

// Скажите, пожалуйста, правильно ли так оформлять print, чтобы не
// выходить за рамку?
print(
    """
    Сумма вклада через \(period) лет
    увеличится на \(round(totalProfit * 100) / 100) рублей
    и составит \(round(deposit * 100) / 100) рублей\n
    """
)


/*:
 ## Задание 2
 2.1 Создайте целочисленный массив данных с любым набором чисел.
*/

//: 2.2 Выведите на консоль все четные числа из массива

/*: 2.3* В циклах для перехода к следующей итерации без выполнения последующего кода можно использовать оператор `Continue`. В этом случае весь последующий код игнорируется.
 
 Используя оператор `Continue` выведите на консоль все нечетные числа из массива. Для этого нужно выполнить проверку на четность числа, и если оно оказалось четным перейти к следующей итерации.
*/


let numbers = [1, 8, 3, 9, 12]

for number in numbers {
    if number % 2 == 0 {
        print(number, terminator: " ")
    }
}

print("\n")

for number in numbers {
    if number % 2 == 0 {
        continue
    }
    print(number, terminator: " ")
}

print("\n")

/*: ## Задание 3
Создайте цикл с интервалом от 1 до 10 в котором случайным образом должно вычисляться число в пределах от 1 до 10. Если выпадет число 5, выведите на консоль сообщение с номером итерации и остановите цикл. Пример сообщения: "Что бы выпало число 5 понадобилось <...> итераций".

Для остановки цикла используйте оператор break. Данный оператор предназначен для досрочного завершения работы цикла. При этом весь последующий код в теле цикла игнорируется.
 
 Для определения случайного числа используйте функцию random: `Int.random(1...10)`
*/

for iteration in 1...10 {
    let number = Int.random(in: 1...10)
    
    if number == 5 {
        print(
            """
           Чтобы выпало число 5, понадобилось \(iteration) итераций\n
           """
        )
        break
    }
}

/*:
 ## Задание 4
  На 10 метровый столб лезет черепашка. За день она забирается на два метра, за ночь съезжает на один. Определите при помощи цикла, через сколько дней она заберется на столб? Подумайте над тем, какой цикл использовать в этой ситуации.
 */


let finalDestination = 10
var presentDestination = 0
var countOfDays = 0
var checkResult = false

// Скажите, пожалуйста, как правильно оформлять отступы
// в подобных конструкциях или они не нужны?
while !checkResult {
    countOfDays += 1
    presentDestination += 2
    checkResult =
        presentDestination == finalDestination
            ? true
            : false
    presentDestination -= 1
}

print(
    """
    Черепашка залезет на \(finalDestination) метровый столб
    за \(countOfDays) дней
    """
)


